# Common
brew "git"                    
brew "wget"                    
brew "curl"                    
brew "mas"                   
brew "jq"
brew "vim"                     

# Containerization
brew "docker"                 
brew "docker-compose"         
brew "colima"                  
brew "lazydocker"

# Programming Languages
brew "nvm"                   
brew "uv"                 

# Development
cask "visual-studio-code"    
cask "cursor"                 
cask "iterm2"                
cask "warp"                  
cask "insomnia"              
cask "figma"                 

# Browsers
cask "google-chrome"
cask "firefox"

# Communication
cask "discord"
cask "telegram"
cask "slack"             
