# Search all available formulae and casks at https://formulae.brew.sh

# Common
brew 'git'
brew 'wget'
brew 'curl'
brew 'mas'
brew 'jq'
brew 'vim'
brew 'fzf'

# Containerization
brew 'docker'
brew 'docker-compose'
brew 'colima'
brew 'lima-additional-guestagents'
brew 'lazydocker'
brew 'qemu'
brew 'kubernetes-cli'
brew 'helm'
brew 'krew'
brew 'k9s'

# DNS
brew 'dnsmasq'

# Programming Languages, Runtimes, and Package Managers
brew 'nvm'
brew 'uv'
brew 'oven-sh/bun/bun'
brew 'deno'
brew 'pnpm'

# Development
cask 'visual-studio-code'
cask 'cursor'
cask 'iterm2'
cask 'warp'
cask 'insomnia'
cask 'figma'

# Cloud
cask 'gcloud-cli'

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'arc'

# Communication
cask 'discord'
cask 'telegram'
cask 'slack'
cask 'zoom'

# Etc
cask 'stats'
cask 'vlc'
cask 'keka' # winrar alternative
cask 'inkscape' # vector design app
