# Search all available formulae and casks at https://formulae.brew.sh

# Common
brew 'git'
brew 'wget'
brew 'curl'
brew 'mas'
brew 'jq'
brew 'vim'
brew 'fzf'

# Containerization
brew 'docker'
brew 'docker-compose'
brew 'colima'
brew 'lima-additional-guestagents'
brew 'lazydocker'
brew 'qemu'
brew 'kubernetes-cli'
brew 'helm'
brew 'krew'
brew 'k9s'

# Programming Languages, Runtimes, and Package Managers
brew 'mise'

# Development
cask 'visual-studio-code'
cask 'ghostty'
cask 'antigravity'
brew 'starship'
cask 'bruno'

# Cloud
cask 'gcloud-cli'

# Browsers
cask 'google-chrome'
cask 'firefox'
cask 'thebrowsercompany-dia'

# Communication
cask 'zoom'

# Etc
cask 'stats'
cask 'vlc'
cask 'keka' # winrar alternative
